{"pageProps":{"post":{"title":"Mario Kart World Toolkit","date":"2025-07-19","slug":"mario-kart-world-toolkit","excerpt":"This is a temprorary post for hosting the alpha version of the Mario Kart World Toolkit.","content":"This is a temprorary post for hosting the alpha version of the Mario Kart World Toolkit.\n\nHow to use the Toolkit:\n\n- [Windows](#windows)\n    - [Download](#download)\n    - [Setup Instructions](#setup-instructions-windows)\n    - [How to choose a track](#how-to-choose-a-track)\n    - [Optional: How to stream with OBS (Windows 11)](#optional-how-to-stream-with-obs-windows-11)\n    - [How to test the program for pre-release testing](#how-to-test-the-program-for-pre-release-testing)\n- [DISCLAIMER](#disclaimer)\n\n## Windows\n\n### Download\n\n- [v0.0.3](https://github.com/breadbored/breadbored.github.io/releases/download/v0.0.3-alpha/MKWorld.Toolkit_0.0.3_x64-setup.exe) (latest)\n    - Changes:\n        - Added user Data Consent dialog for error reporting\n            - Error reporting helps me fix bugs in the program.\n            - Data is not shared with anyone except me, and is not used for any other purpose.\n        - Added support for Windows 11 camera sharing\n            - This allows you to use the capture card in OBS while also using it in the MKWorld Toolkit (see [Optional: How to stream with OBS (Windows 11)](#optional-how-to-stream-with-obs-windows-11) for instructions).\n        - Fixed a bug where all times would report negative if the game pauses\n        - Fixed a bug where auto-splits get triggered when the game is paused or the player falls off the track\n- v0.0.2 (removed)\n    - Changes:\n        - Added support for Windows 10\n        - (update) this version did not include error tracking, which is necessary for proper testing while in Alpha.\n- v0.0.1\n    - Initial build for MacOS (not Windows or Linux)\n    - Features:\n        - Functionality for running Time Trials\n        - Functionality for auto-splitting\n        - Functionality for streaming with OBS (MacOS only)\n        - Functionality for using a capture card\n        - Settings / Configuration for tracks and times, as well as app settings\n\n### Setup Instructions (Windows)\n\n- (Optional) If you want to stream MKWorld with OBS, you must download use Windows 11 (or Mac or Linux when I publish the releases for those platforms).\n    - You need this (for now) because Windows 10 doesn't support multiple applications using the same capture card at the same time, but Windows 11 has an option for it you can enable. I am trying to develop a built-in virtual camera for the toolkit for Windows Pre-11 users, but it is not ready yet.\n    - See [Optional: How to stream with OBS (Windows 11)](#optional-how-to-stream-with-obs-windows-11) for instructions on how to set this up.\n- Download the [Windows](https://github.com/breadbored/breadbored.github.io/releases/download/v0.0.2-alpha/MKWorld.Toolkit_0.0.2_x64-setup.exe) version of the MKWorld Toolkit.\n- Run the installer and follow the instructions.\n- Once installed, open MKWorld Toolkit.\n\n### How to choose a track\n\n- Click the top left menu button and select \"Split Management\" in the menu.\n- Choose the track you want to run, put in the times you want to compare against, and then click the save button at the very bottom of the screen.\n\n### (Optional) How to stream with OBS (Windows 11)\n\nYou must have OBS and Windows 11.\n\n#### Set up your capture card in Windows 11:\n\nInstructions with images can be found [here](https://www.elevenforum.com/t/enable-or-disable-multiple-apps-to-use-camera-in-windows-11.31199/).\n\n- Open Windows 11 Settings with `Win + I`.\n- Go to \"*_Bluetooth & devices_*\"\n- Click \"*_Cameras_*\"\n- Under *_Connected cameras_* , click on the capture card (e.g. \"MiraBox\") you want to change this setting for.\n- Click on the *_Edit_* button for *_Advanced camera options_*.\n- Turn `on` or `off` *_Allow multiple apps to use camera at the same time_* for what you want, and click on Apply.\n\n#### Set up OBS to use the capture card:\n\n- Open MKWorld Toolkit\n- Open OBS and add a new source.\n- Choose \"Video Capture Device\" and select the SplitCam camera as the device.\n- Add a webview source and set the URL to `http://localhost:2025/obs`.\n  - Set the size to 800x1080, or whatever size you want the speedrun split UI to be.\n- Arrange to flavor.\n\n### How to test the program for pre-release testing\n\n- Open the MKWorld Toolkit.\n- Once MKWorld Toolkit is opened, you can navigate to http://localhost:2025/obs in your web browser.\n    - You should now see the speedrun split UI.\n- In the MKWorld Toolkit, go to the \"Camera Capture\" tab if you are not already there.\n- Select your capture card and then click the \"Start Capture Card\" button.\n- Play a Time Trial!\n    - ***NOTE: If none of the following happens, refresh the http://localhost:2025/obs page in your web browser.***\n    - Once the timer in game is detected to be 0:00.000, the timer will reset.\n    - Once the race starts, the timer will start counting up.\n    - Once a lap is completed, the timer will stop and the splits will be updated.\n    - Once the race is completed, the timer will stop and the splits will be updated.\n    - The timer resets when you restart the race.\n\n## DISCLAIMER\n\nMKWorld Toolkit is in ALPHA. It was originally built for my own personal use on MacOS, and Windows is in an untested state.","categories":["mariokartworld"],"skeets":[]}},"__N_SSG":true}